//============================================================================
// Компилятор  : g++ v. 10.2.1
// Название    : LinkedList.h
// Автор       : Лебедев Иван
// Группа      : М3О-211Б-20
// Содержание  : Прототип и определение класса LinkedList
//============================================================================
#include "Deque.h" // Заголовочный файл с двусвязным списком
#include <iostream>		// Библиотека для работы с входным/выходным потоками

using namespace std; // Пространство имён для работы с функциями стандартной библиотеки


int main() {
	Deque<int> d;
	d.Clear();
	d.PushBack(3);
	cout << d.GetFirst() << endl;
	d.GetFirst() = 5;
	cout << d.GetFirst() << endl;
	d[0] = 22;
	cout << d.GetFirst() << endl;
	Deque<int> d2;
	d2 = d;
	cout << d2[0] << endl;
	d[0] = 77;
	cout << d2[0] << endl;
	return 0;
}
